Revit 2022 API
SpecUtils.GetSpecTypeId Method
 Gets the ForgeTypeId identifying the spec corresponding to the given ParameterType value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2022
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a future version of Revit. It will not be replaced, but until its removal it may be used to help migrate code that uses the 'ParameterType' enumeration to the ForgeTypeId class.")]
public static ForgeTypeId GetSpecTypeId(
	ParameterType parameterType
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a future version of Revit. It will not be replaced, but until its removal it may be used to help migrate code that uses the 'ParameterType' enumeration to the ForgeTypeId class.")> _
Public Shared Function GetSpecTypeId ( _
	parameterType As ParameterType _
) As ForgeTypeId
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2022 and may be removed in a future version of Revit. It will not be replaced, but until its removal it may be used to help migrate code that uses the 'ParameterType' enumeration to the ForgeTypeId class.")]
public:
static ForgeTypeId^ GetSpecTypeId(
	ParameterType parameterType
)
Parameters
parameterType
Type: Autodesk.Revit.DB.ParameterType
 The ParameterType value.
Return Value
 Identifier of the spec corresponding to the given ParameterType value.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
SpecUtils Class
Autodesk.Revit.DB Namespace